In [12]:
import pandas as pd
import sqlite3

df = pd.read_csv('D:\Code\HR_Attrition_Analyzer\data\employee_cleaned.csv')

conn = sqlite3.connect('hr_attrition.db')
df.to_sql('hr', conn, if_exists='replace', index=False)
conn.close()
print("Đã tạo database hr_attrition.db với bảng hr")

Đã tạo database hr_attrition.db với bảng hr

<>:4: SyntaxWarning: invalid escape sequence '\C'
<>:4: SyntaxWarning: invalid escape sequence '\C'
C:\Users\vovan\AppData\Local\Temp\ipykernel_14316\2453243665.py:4: SyntaxWarning: invalid escape sequence '\C'
  df = pd.read_csv('D:\Code\HR_Attrition_Analyzer\data\employee_cleaned.csv')

In [13]:
# Kết nối tới database SQLite
conn = sqlite3.connect("hr_attrition.db")

# 1. Tỷ lệ nghỉ việc (Attrition) theo phòng ban (Department)

In [14]:
query = """
SELECT Department,
       ROUND(AVG(Attrition)*100,2) AS Attrition_Rate_Percent,
       COUNT(*) AS Total_Employees
FROM hr
GROUP BY Department
ORDER BY Attrition_Rate_Percent DESC;
"""

df_result = pd.read_sql_query(query, conn)
df_result

               Department  Attrition_Rate_Percent  Total_Employees
0                   Sales                   20.63              446
1         Human Resources                   19.05               63
2  Research & Development                   13.84              961

# 2. Tỷ lệ nghỉ việc theo JobRole

In [15]:
# Câu truy vấn SQL: Tính tỷ lệ nghỉ việc theo từng chức danh công việc
query = """
SELECT JobRole,
       ROUND(AVG(Attrition)*100, 2) AS Attrition_Rate_Percent,
       COUNT(*) AS Total_Employees
FROM hr
GROUP BY JobRole
ORDER BY Attrition_Rate_Percent DESC;
"""

# Thực hiện truy vấn và lưu kết quả vào DataFrame
df_role = pd.read_sql_query(query, conn)
# Hiển thị kết quả phân tích
df_role

                     JobRole  Attrition_Rate_Percent  Total_Employees
0       Sales Representative                   39.76               83
1      Laboratory Technician                   23.94              259
2            Human Resources                   23.08               52
3            Sales Executive                   17.48              326
4         Research Scientist                   16.10              292
5     Manufacturing Director                    6.90              145
6  Healthcare Representative                    6.87              131
7                    Manager                    4.90              102
8          Research Director                    2.50               80

# 3. Ảnh hưởng của Overtime tới nghỉ việc

In [16]:

query = """
SELECT OverTime,
       ROUND(AVG(Attrition)*100, 2) AS Attrition_Rate_Percent,
       COUNT(*) AS Total_Employees
FROM hr
GROUP BY OverTime
ORDER BY Attrition_Rate_Percent DESC;
"""

df_overtime = pd.read_sql_query(query, conn)

df_overtime

  OverTime  Attrition_Rate_Percent  Total_Employees
0      Yes                   30.53              416
1       No                   10.44             1054

# 4. Tỷ lệ nghỉ việc theo nhóm tuổi (Age)

In [17]:
# Bước 2: Câu truy vấn SQL – Phân tích tỷ lệ nghỉ việc theo nhóm tuổi
query = """
SELECT
  CASE 
    WHEN Age < 30 THEN '<30'
    WHEN Age BETWEEN 30 AND 39 THEN '30-39'
    ELSE '40+'
  END AS Age_Group,
  ROUND(AVG(Attrition)*100, 2) AS Attrition_Rate_Percent,
  COUNT(*) AS Total_Employees
FROM hr
GROUP BY Age_Group
ORDER BY Age_Group;
"""

df_age = pd.read_sql_query(query, conn)

df_age

  Age_Group  Attrition_Rate_Percent  Total_Employees
0     30-39                   14.31              622
1       40+                   10.92              522
2       <30                   27.91              326

# 5. So sánh thu nhập trung bình giữa nghỉ việc và không nghỉ việc

In [18]:
query = """
SELECT Attrition,
       ROUND(AVG(MonthlyIncome), 2) AS Avg_Monthly_Income,
       COUNT(*) AS Total_Employees
FROM hr
GROUP BY Attrition;
"""


df_income = pd.read_sql_query(query, conn)

df_income

   Attrition  Avg_Monthly_Income  Total_Employees
0          0             6832.74             1233
1          1             4787.09              237